In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector as connector
import warnings
warnings.filterwarnings("ignore")

In [3]:
conn = connector.connect(
   host="localhost",      # or "127.0.0.1"
    user="root",           # your MySQL username
    password="1234",
    database="world"
)

In [ ]:
query = """
SHOW TABLES
"""
df = pd.read_sql(query, conn)
df.head()

   Tables_in_world
0             city
1          country
2  countrylanguage